{
  "backend/main.mo": "Main Motoko actor defining data types (UserProfile, Ad, AdWatch, WithdrawalRequest), state maps/lists, and backend functions for user profiles, ad management, ad watching/claiming, dashboard stats, and withdrawal requests with access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (user registration, ad watching flow, dashboard, withdrawal system) to their corresponding source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries for each frontend source file, serving as a reference index for the project's frontend components, pages, hooks, and styles.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React app with a root div mount point and a module script tag loading main.tsx; page title is 'PTC Website'.",
  "frontend/src/App.tsx": "Main React entry point that configures TanStack Router with routes for landing, dashboard, ads list, watch-ad, and withdrawal pages, and renders ProfileSetupModal and Toaster at the root level.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button supporting three visual variants (default, hero, nav) with loading state handling and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal dialog that collects username and email from new users and saves their profile via the `useSaveCallerUserProfile` mutation. It blocks dismissal until the profile is successfully submitted.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that wraps all pages with a sticky Header, a main content outlet, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky navigation header showing the AdEarn logo, nav links (Dashboard, Watch Ads, Withdraw), user balance, and a login button; includes a responsive mobile menu toggled by a hamburger icon.",
  "frontend/src/components/WithdrawalHistoryTable.tsx": "Table component that fetches and displays the caller's withdrawal history sorted by date, with colored status badges (pending/approved/rejected) and loading skeletons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage Internet Identity authentication state, including login, logout, and persisted identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the backend actor, covering user profile, ads, ad watches, dashboard stats, and withdrawal operations with appropriate cache invalidation on mutations.",
  "frontend/src/index.css": "Global stylesheet defining a navy/gold dark theme via CSS custom properties (oklch), Tailwind base/utilities, and custom utility classes for gold gradients, glows, navy cards, and status badges.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrapping the root `App` component.",
  "frontend/src/pages/AdsPage.tsx": "Displays a grid of available ads with daily watch tracking, showing stats (total, available today, watched today) and linking to individual ad watch pages.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard showing earnings stats (balance, ads watched today, total watched), recent ad watch history, and a withdrawal history table.",
  "frontend/src/pages/LandingPage.tsx": "Public marketing landing page for AdEarn, featuring a hero section, how-it-works steps, feature highlights, and a login button.",
  "frontend/src/pages/WatchAdPage.tsx": "Ad viewing page with a countdown timer that must complete before the user can claim a $100 reward, then navigates back to the ads list.",
  "frontend/src/pages/WithdrawalPage.tsx": "Withdrawal request form that validates a minimum $500 amount against the user's balance, submits the request, and displays withdrawal history.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom theme with gold/navy color palette, Inter/Bebas Neue fonts, custom shadows, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata for a PTC (Paid-To-Click) platform where users earn $100 per ad watched, tracking existing features, architectural notes, image requirements, and build history."
}